In [204]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math
import random
from random import randint 
import datetime
# from env import host, user, password
# url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [ ]:
# Exercises I
# Run python -m pip install pymysql from your terminal to install pymysql.

# Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

# Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)
# cd into your exercises folder for this module and run echo env.py >> .gitignore





# Once you have successfully run a query:

# a. Intentionally make a typo in the database url. What kind of error message do you see?

# b. Intentionally make an error in your SQL query. What does the error message look like?

# Read the employees and titles tables into two separate DataFrames.

# How many rows and columns do you have in each DataFrame? Is that what you expected?

# Display the summary statistics for each DataFrame.

# How many unique titles are in the titles DataFrame?

# What is the oldest date in the to_date column?

# What is the most recent date in the to_date column?

In [17]:
# 3. # Create a function named get_db_url. 
# It should accept a username, hostname, password, and database name and return a url connection string formatted 
# like in the example at the start of this lesson.

def get_db_url(str_mysql_db):
    from env import user, password, host
    return f'mysql+pymysql://{user}:{password}@{host}/{str_mysql_db}'

In [ ]:
# 4. Use your function to obtain a connection to the employees database.

get_db_url('employees')

In [ ]:
# 5. Once you have successfully run a query:

# 5a. Intentionally make a typo in the database url. What kind of error message do you see?

test_url = get_db_url('employee')
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', test_url)
# returns back the following error message
# OperationalError: (1044, "Access denied for user 'kalpana_1823'@'%' to database 'employee'")

In [ ]:
# 5b. Intentionally make an error in your SQL query. What does the error message look like?

url = get_db_url('employees')
pd.read_sql('SELECT * FROM employees LIMT 5 OFFSET 50', url) # "LIMT" instead of "LIMIT" typo

# sql query typo returns back the following error message:
# ProgrammingError: (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '5 OFFSET 50' at line 1")

In [23]:
# 6. Read the employees and titles tables into two separate DataFrames.

url = get_db_url('employees')

employees_table = pd.read_sql('SELECT * FROM employees', url)
employees_table.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [154]:
employees_db_tables = pd.read_sql('SHOW TABLES', url)
titles_table = pd.read_sql('SELECT * FROM titles', url)

titles_table.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [28]:
# 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

employees_table.shape

# 300,024 rows/records
# 6 columns

(300024, 6)

In [29]:
# 7. continued

titles_table.shape

# 443,308 rows/records
# 4 columns

(443308, 4)

In [60]:
# 8. Display the summary statistics for each DataFrame

# notes:
# first, i want to check the 'type' of data that i am working with
# i've noticed that numerical values such as dates are 'object' data types in this table
# i may be able to run descriptive statistics on these dates, so i will take the following approach...
# from datetime import datetime
# create a copy of the employees table - 
# this is so that I dont hard code any changes to the original datafram and should i need to refer back to it
# i then want to change the column 'date' data type to datetime type
# i want to then return the orginal table and check to see if any discrepancies/error occur
# lastly, run another 'describe()' and check what is returned

employees_table.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [62]:
employees_table_copy = employees_table.copy()

In [37]:
employees_table_copy = employees_table.copy()
employees_table_copy

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [63]:
# 8. continued 

titles_table.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [65]:
titles_table.dtypes # samething with above 'employees' table and dates being read as 'object' types

emp_no        int64
title        object
from_date    object
to_date      object
dtype: object

In [77]:
# 9. How many unique titles are in the titles DataFrame?

titles_table.title.unique()

# there are 7 unique title positions

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

In [92]:
# 10. What is the oldest date in the to_date column?
# example: mpg[mpg['manufacturer'] == 'dodge'].sort_values(by=['average_mileage'], ascending=[False])

titles_table.sort_values(by=['to_date']).head()

# where 1985-03-01 is the oldest to_date

        emp_no            title   from_date     to_date
16064    20869         Engineer  1985-02-17  1985-03-01
406358  474918         Engineer  1985-02-10  1985-03-11
346216  434232            Staff  1985-02-26  1985-03-20
35527    34059  Senior Engineer  1985-02-10  1985-03-23
277603  287732            Staff  1985-04-14  1985-04-17

In [194]:
titles_table = titles_table.drop(columns=['not_current'])

In [208]:
# 11. What is the most recent date in the to_date column?

# i want to not account for current roles; denoted as "9999-01-01"
# to_date column data type = 'object'
# will want to create a new boolean column to filter for roles that are current
# can then sort_values by not_current = 'true' and to_date = in descending ordder
# this should indicate roles that are not current, but that are 'most' current


# where there are 40 records with to_date = '2002-08-01' the most recent employee date
titles_table['current'] = titles_table['to_date'] == datetime.date(9999, 1, 1) # not working properly
titles_table

        emp_no            title   from_date     to_date  current
0        10001  Senior Engineer  1986-06-26  9999-01-01     True
1        10002            Staff  1996-08-03  9999-01-01     True
2        10003  Senior Engineer  1995-12-03  9999-01-01     True
3        10004         Engineer  1986-12-01  1995-12-01    False
4        10004  Senior Engineer  1995-12-01  9999-01-01     True
...        ...              ...         ...         ...      ...
443303  499997         Engineer  1987-08-30  1992-08-29    False
443304  499997  Senior Engineer  1992-08-29  9999-01-01     True
443305  499998     Senior Staff  1998-12-27  9999-01-01     True
443306  499998            Staff  1993-12-27  1998-12-27    False
443307  499999         Engineer  1997-11-30  9999-01-01     True

[443308 rows x 5 columns]

In [120]:
titles_table.dtypes

emp_no          int64
title          object
from_date      object
to_date        object
not_current      bool
dtype: object

In [216]:
titles_table.sort_values(by=['current', 'to_date'], ascending=[True, False])

# where last & most recent title held was '2002-08-01'

        emp_no            title   from_date     to_date  current
15192    20278     Senior Staff  1999-11-04  2002-08-01    False
17375    21763            Staff  1994-08-01  2002-08-01    False
23636    26000            Staff  1997-08-01  2002-08-01    False
67905    55876            Staff  1995-08-01  2002-08-01    False
80193    64174         Engineer  1996-08-01  2002-08-01    False
...        ...              ...         ...         ...      ...
443300  499995         Engineer  1997-06-02  9999-01-01     True
443302  499996  Senior Engineer  2002-05-13  9999-01-01     True
443304  499997  Senior Engineer  1992-08-29  9999-01-01     True
443305  499998     Senior Staff  1998-12-27  9999-01-01     True
443307  499999         Engineer  1997-11-30  9999-01-01     True

[443308 rows x 5 columns]

In [249]:
# i want to also include a column for the total number of years held in this role
# datetime has a function called 'timedelta'

titles_table[titles_table['to_date'] == datetime.date(2002, 8, 1)].sort_values(by='from_date')

        emp_no               title   from_date     to_date  current
154568  204324    Technique Leader  1985-02-10  2002-08-01    False
209437  241571     Senior Engineer  1990-01-05  2002-08-01    False
339121  429386        Senior Staff  1990-02-03  2002-08-01    False
364701  446732     Senior Engineer  1992-11-10  2002-08-01    False
203061  237207            Engineer  1993-08-01  2002-08-01    False
235813  259430            Engineer  1993-08-01  2002-08-01    False
164220  210868            Engineer  1993-08-01  2002-08-01    False
291839  297339               Staff  1993-08-01  2002-08-01    False
373713  452819            Engineer  1993-08-01  2002-08-01    False
304108  405703            Engineer  1994-08-01  2002-08-01    False
17375    21763               Staff  1994-08-01  2002-08-01    False
308446  408664               Staff  1994-08-01  2002-08-01    False
197394  233358               Staff  1994-08-01  2002-08-01    False
128288   96599            Engineer  1994-08-01  2002-08-01    False
118697   90134               Staff  1994-08-01  2002-08-01    False
320376  416723  Assistant Engineer  1994-08-01  2002-08-01    False
116306   88539               Staff  1995-08-01  2002-08-01    False
280179  289500               Staff  1995-08-01  2002-08-01    False
67905    55876               Staff  1995-08-01  2002-08-01    False
365960  447596               Staff  1996-08-01  2002-08-01    False
436756  495525               Staff  1996-08-01  2002-08-01    False
197364  233339            Engineer  1996-08-01  2002-08-01    False
158107  206731            Engineer  1996-08-01  2002-08-01    False
154942  204587            Engineer  1996-08-01  2002-08-01    False
80193    64174            Engineer  1996-08-01  2002-08-01    False
143273  106707               Staff  1997-08-01  2002-08-01    False
177341  219722  Assistant Engineer  1997-08-01  2002-08-01    False
387242  461960               Staff  1997-08-01  2002-08-01    False
23636    26000               Staff  1997-08-01  2002-08-01    False
135654  101563               Staff  1997-08-01  2002-08-01    False
119478   90666            Engineer  1997-08-01  2002-08-01    False
251244  269877        Senior Staff  1997-11-04  2002-08-01    False
261372  276731     Senior Engineer  1998-01-09  2002-08-01    False
147796  109776               Staff  1998-05-28  2002-08-01    False
399465  470224        Senior Staff  1999-08-08  2002-08-01    False
319569  416185               Staff  1999-10-28  2002-08-01    False
15192    20278        Senior Staff  1999-11-04  2002-08-01    False
366762  448129        Senior Staff  2001-01-23  2002-08-01    False
391712  464962     Senior Engineer  2001-02-23  2002-08-01    False
209212  241410     Senior Engineer  2001-04-20  2002-08-01    False

In [219]:
previous_roles = titles_table[titles_table['current'] == False]
previous_roles

        emp_no               title   from_date     to_date  current
3        10004            Engineer  1986-12-01  1995-12-01    False
6        10005               Staff  1989-09-12  1996-09-12    False
9        10007               Staff  1989-02-10  1996-02-11    False
10       10008  Assistant Engineer  1998-03-11  2000-07-31    False
11       10009  Assistant Engineer  1985-02-18  1990-02-18    False
...        ...                 ...         ...         ...      ...
443297  499992               Staff  1987-05-10  1992-05-09    False
443299  499994            Engineer  1993-02-22  1993-10-27    False
443301  499996            Engineer  1996-05-13  2002-05-13    False
443303  499997            Engineer  1987-08-30  1992-08-29    False
443306  499998               Staff  1993-12-27  1998-12-27    False

[203184 rows x 5 columns]

In [248]:
last_and_most_recent = previous_roles[['to_date']].sort_values(by='to_date', ascending=False)
last_and_most_recent[last_and_most_recent['to_date'] == datetime.date(2002, 8, 1)].value_counts()

# there are 40 records with to_date = '2002-08-01'

to_date
2002-08-01    40
dtype: int64

In [ ]:
# Exercise Part 2

In [265]:
# 1. Copy the users and roles DataFrames from the examples above.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})

In [266]:
# 2. What is the result of using a right join on the DataFrames?

user_roles = users.merge(roles, left_on='role_id', right_on='id', how='right')
user_roles

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [267]:
user_roles = user_roles.drop(columns='role_id') # removing the 'role_id' column since it is 1. float data type and 2. is reflected in the joined table 'role_id'

In [268]:
user_roles

   id_x name_x  id_y     name_y
0   1.0    bob     1      admin
1   2.0    joe     2     author
2   3.0  sally     3   reviewer
3   4.0   adam     3   reviewer
4   NaN    NaN     4  commenter

In [277]:
user_roles = user_roles.rename(columns={'name_x': 'user_name', 'id_x': 'name_id', 'id_y': 'role_id', 'name_y': 'role'})
user_roles

   name_id user_name  role_id       role
0      1.0       bob        1      admin
1      2.0       joe        2     author
2      3.0     sally        3   reviewer
3      4.0      adam        3   reviewer
4      NaN       NaN        4  commenter

In [278]:
user_roles.dtypes

name_id      float64
user_name     object
role_id        int64
role          object
dtype: object

In [279]:
# 3. What is the result of using an outer join on the DataFrames?

# it produces a one-for-one match where the role_id (left table) matches the id (right table) and brings over any right table remaining ids/values

users.merge(roles, left_on='role_id', right_on='id', how='outer')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [281]:
# 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

user_key_drop = users.drop(columns='role_id')
roles_key_drop = roles.drop(columns='id')

In [ ]:
user_key_drop.merge(roles_key_drop, left_on='role_id', right_on='id')

# without the proper 'merging' keys, this returns a KeyError
# interestingly enough it identified the 'right merging' table as the missing/or invalid key 'id'
# i will attempt the inverse of this code below and review what happens when i attempt to merge in the opposite direction

In [ ]:
# test
# similar to above, this also returns a KeyError from the merging 'right' table referenced key 'role_id'

roles_key_drop.merge(user_key_drop, left_on='id', right_on='role_id', how='inner')

In [287]:
# 5. Load the mpg dataset from PyDataset

from pydataset import data
mpg = data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [293]:
# 6. Output and read the documentation for the mpg dataset

# what is meant by read the mpg dataset?

mpg = data('mpg')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [294]:
# 7. How many rows and columns are in the dataset?

# 234 rows
# 11 columns

mpg.shape

(234, 11)

In [296]:
# 8. Check out your column names and perform any cleanup you may want on them.

mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [306]:
mpg = mpg.rename(columns={'drv': 'drivetrain', 'cty': 'city_miles', 'hwy': 'hwy_miles', 'engine_ltrs': 'engine_liters', 'cyl': 'cylinders'})
mpg

,manufacturer,model,engine_liters,year,cylinders,trans,drivetrain,city_miles,hwy_miles,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [307]:
mpg.dtypes

manufacturer      object
model             object
engine_liters    float64
year               int64
cylinders          int64
trans             object
drivetrain        object
city_miles         int64
hwy_miles          int64
fl                object
class             object
dtype: object

In [308]:
# 9. Display the summary statistics for the dataset

mpg.describe()

       engine_liters         year   cylinders  city_miles   hwy_miles
count     234.000000   234.000000  234.000000  234.000000  234.000000
mean        3.471795  2003.500000    5.888889   16.858974   23.440171
std         1.291959     4.509646    1.611534    4.255946    5.954643
min         1.600000  1999.000000    4.000000    9.000000   12.000000
25%         2.400000  1999.000000    4.000000   14.000000   18.000000
50%         3.300000  2003.500000    6.000000   17.000000   24.000000
75%         4.600000  2008.000000    8.000000   19.000000   27.000000
max         7.000000  2008.000000    8.000000   35.000000   44.000000

In [310]:
# 10. How many different manufacturers are there?

# there 15 unique manufacturers in the mpg-dataset
len(mpg.manufacturer.unique())

15

In [319]:
# 11. How many different models are there?

# there are 38 unique vehicle model types 

len(mpg.model.unique())

38

In [314]:
# 12. Create a column named mileage_difference like you did in the DataFrames exercises; 
# this column should contain the difference between highway and city mileage for each car

mpg['mileage_difference (hwy-city)'] = mpg.hwy_miles - mpg.city_miles
mpg

,manufacturer,model,engine_liters,year,cylinders,trans,drivetrain,city_miles,hwy_miles,fl,class,mileage_difference,mileage_difference (hwy-city)
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,9

In [317]:
mpg['average_mileage'] = (mpg.city_miles + mpg.hwy_miles) / 2
mpg

,manufacturer,model,engine_liters,year,cylinders,trans,drivetrain,city_miles,hwy_miles,fl,class,mileage_difference,mileage_difference (hwy-city),average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,9,21.5

In [318]:
# 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage

mpg[['city_miles', 'hwy_miles']].agg(['mean']) # aggregating all vehicle city and hwy mileage

      city_miles  hwy_miles
mean   16.858974  23.440171

In [325]:
# 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

mpg['is_automatic'] = mpg['trans'].str.contains('auto') == True
mpg

,manufacturer,model,engine_liters,year,cylinders,trans,drivetrain,city_miles,hwy_miles,fl,class,mileage_difference,mileage_difference (hwy-city),average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,9,21.5,True

In [327]:
# 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

mpg.average_mileage.nlargest(n=1, keep='all')
mpg.loc[222]

manufacturer                     volkswagen
model                            new beetle
engine_liters                           1.9
year                                   1999
cylinders                                 4
trans                            manual(m5)
drivetrain                                f
city_miles                               35
hwy_miles                                44
fl                                        d
class                            subcompact
mileage_difference                        9
mileage_difference (hwy-city)             9
average_mileage                        39.5
is_automatic                          False
Name: 222, dtype: object

In [328]:
# 16. Do automatic or manual cars have better miles per gallon?

# manual cars have a better average mileage by ~3mpg

mpg.groupby('is_automatic').average_mileage.mean()

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64